paypal-connector-test/src/test/resources/artifacts/ESB/config/soapRequests/paypal/reAuthorizePayment.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="wso2.connector.paypal.reauthorizepayment">
   <soapenv:Header/>
   <soapenv:Body>
     <urn:paypalApiUrl>https://api.sandbox.paypal.com</urn:paypalApiUrl>
     <urn:authorization>Bearer 7RDA.3yMKBJrpm.wu-3FPuJ1r7mXqfe6mcIehN64CWE</urn:authorization>
     <urn:authorizationId>7UJ44482LF595130T</urn:authorizationId>
     <urn:amountValue>7.00</urn:amountValue>
     <urn:currencyCode>USD</urn:currencyCode>
   </soapenv:Body>
</soapenv:Envelope>
